---
marp: true
---

<style>
.columns {
  display: flex;
  gap: 50px;
  align-items: center;
}
.columns img {
  width: 300px;
  height: auto;
}
.columns .text {
  flex: 1;
}
</style>

# Повторение

## Ввод-вывод
## Условия - простые и сложные
## Логические значения

---


# Изучаем язык Python
## Занятие 5 - Цикл for

---

В Python итерация относится ко всему, что можно зациклить, например к строке, списку, кортежу или словарю, диапазону чисел.
Синтаксис цикла итерации следующий:

```python
for a in iterable:
 print(a)
```
Самое простое, что можно подставить в iterable - это список значений.
Пример:

```python
pets = ['cats', 'dogs', 'rabbits', 'hamsters']

for myPets in pets:
 print(myPets)
```

---

При запуске программы вы увидите:

```python
cats
dogs
rabbits
hamsters
```

---

Можно отобразить индекс элементов списка. Для этого
используется функция enumerate():

```python
for index, myPets in enumerate(pets):
print(index, myPets)
```

```
Вывод будет следующим:
0 cats
1 dogs
2 rabbits
3 hamster
```
---

## Задача - Поэты серебряного века

С помощью списка и цикла for вывести на экран фамилии поэтов серебряного века.

Дополнительное задание - перед фамилиями вывести порядковый номер
(начиная с единицы).

Сделать самостоятельно.

---

## ПЕРЕБОР ЧИСЛОВОЙ ПОСЛЕДОВАТЕЛЬНОСТИ

---

Для перебора последовательности чисел удобно воспользоваться встроенной функцией range(). 
Функция range() генерирует список чисел и имеет следующий
синтаксис:

```python
range(начало, конец, шаг).
```

Полезно запомнить, что в Python (как и в большинстве языков программирования) числовые серии начинаются с нуля, если явно не указано обратное. Например, индексы списка и кортежи начинаются
с нуля.
Если при использовании функции range() начало последовательности не указано, то генерируемые числа начинаются с нуля.
Если шаг не указан, то функция генерирует список последовательных чисел (т. е. шаг = 1). Конечное значение задается обязательно. 

У функции range() есть одна странность: 

конечное значение никогда не входитв генерируемый список.
Например:
range(5) генерирует список [0, 1, 2, 3, 4]
range(3, 10) генерирует список [3, 4, 5, 6, 7, 8, 9]
range(4, 10, 2) генерирует список [4, 6, 8]

Чтобы понять, как используется функция range() в командах for, попробуйте выполнить следующий код:
for i in range(5):
 print (i)

Результат:
0
1
2
3
4

---

Задача: вывести список чисел от 200 до 300 включительно.
Задача: вывести список четных чисел от 200 до 300 включительно, делящихся на 3.

Вычислить сумму чисел от 1 до 231 включительно

Классическая задача собеседований Fizz Bazz

Напишите программу, которая выводит на экран числа от 1 до 100. При этом вместо чисел, кратных трем, программа должна выводить слово Fizz, а вместо чисел, кратных пяти — слово Buzz. Если число кратно и трем и пяти, то программа должна выводить слово FizzBuzz.

Задача 2 acmp.ru.

