---
marp: true
---

Школа программирования DeveloBear
# Курс Java
## Урок 1
## Первая программа

---

## Язык Java

Java — это объектно-ориентированный язык программирования, разработанный компанией Sun Microsystems.

- Платформонезависимость : работает на любой системе с установленной JVM (Java Virtual Machine) — "Напиши один раз — запускай где угодно".
- Объектно-ориентированный : всё строится вокруг классов и объектов.
- Строгая типизация : все переменные должны иметь явно указанный тип.
- Автоматическое управление памятью : благодаря сборщику мусора (Garbage Collector).

---

## Команды

Программа — это набор (список) команд. Сначала выполняется первая команда, затем вторая, третья, и так далее. Когда все команды выполнены, программа завершается.

Программы, написанные на языке Java, исполняет JVM (Java Virtual Machine — виртуальная машина Java). JVM — это специальная программа, которая умеет исполнять программы, написанные на языке Java.

---

## Самая простая команда

```java
// выводим на экран сообщение 
System.out.println("Робот — друг человека");
```

---

## Принцип первый:

В языке программирования Java каждую команду принято писать с новой строки. В конце команды ставится точка с запятой.

Допустим, мы хотим 3 раза вывести на экран надпись Робот — друг человека. Вот как будет выглядеть код программы:

```java
//Программа из трех команд

System.out.println("Робот — друг человека");
System.out.println("Робот — друг человека");
System.out.println("Робот — друг человека");
```

---

## Принцип второй: 

Программа не может просто состоять из команд. Команды языка Java должны находиться внутри функций, а функции — внутри классов.

Представьте себе диван. Диван не может быть сам по себе — он находится в какой-то комнате. Комната тоже не может существовать сама по себе — она находится в каком-то доме. Или же можно сказать, что дом делится на комнаты, а комнаты содержат вещи.

Java-программы состоят из классов, классы содержат методы, а методы — команды.

---

## Структура типичной программы

Программы на языке Java состоят из классов. Классов может быть десятки тысяч. Минимальная программа — один класс. Для каждого класса заводится отдельный файл, имя которого совпадает с именем класса.

Допустим, вы решили создать класс, который будет описывать дом (дом по-английски — House). Тогда вам нужно создать класс House, который будет содержаться в файле House.java.

---

## Класс House

Java. Обычно код класса состоит из имени класса и тела класса. Тело класса помещается в фигурные скобки. Вот как может выглядеть класс House:

```java
// файл House.java
public class House {

    int a; 
    int b;
   
    public static void main (String[] args) { 
        System.out.print(1); 
    }
   
    public static double pi() { 
        return 3.14; 
    }
}
```
<!--
В примере выше a и b — это переменные, а main и pi — это методы.
-->

---

## Метод main()

У класса, с которого начинается программа, может быть любое имя, но у метода main, с которого начинает выполняться программа, всегда один и тот же вид:

```java
public class House
{
    public static void main (String[] args)
    {
        // Код метода
    }
}
```

---

## Задача 1 - Java - отличный язык

Написать программу, выводящую на экран надпись «Java - отличный язык». Пример вывода на экран: Java - отличный язык

